name = input('введите имя: ')
lastName = input('введите фамилию: ')
age = 2023 - int(input('введите год вашего рождения: '))
print(lastName, name + ',', age)


# УДАЛИТЬ: кто-то невнимательно читает задание... копия задания в файле задачи не нужна
# В первой строке попросить пользователя ввести имя.
# Во второй строке попросить пользователя ввести фамилию.
# В третьей строке попросить пользователя ввести год рождения.

# Программа должна вывести сначала фамилию, потом имя, затем возраст пользователя. 
# Возраст — число лет — считать без учёта дня и месяца рождения.


# ДОБАВИТЬ: а нужен результат выполнения программы с собственными данными, например:
# введите имя: Имя
# введите фамилию: Фамилия
# введите год вашего рождения: 1000
# Фамилия Имя, 1023
# КОММЕНТАРИЙ: это требование, прописанное в задании — невыполнение требований задания влечёт снижение баллов


# ИТОГ: хорошо — 2/3
