name = input('введите имя: ')
lastName = input('введите фамилию: ')
age = 2023 - int(input('введите год вашего рождения: '))
print(lastName, name + ',', age)

# УДАЛИТЬ: кто-то невнимательно читает задание... копия задания в файле задачи не нужна
# В первой строке попросить пользователя ввести имя.
# Во второй строке попросить пользователя ввести фамилию.
# В третьей строке попросить пользователя ввести год рождения.

# Программа должна вывести сначала фамилию, потом имя, затем возраст пользователя. 
# Возраст — число лет — считать без учёта дня и месяца рождения.

# УДАЛИТЬ: не нужно дублировать код (тем более не изменённый), правки можно выполнять в самом коде — вся история изменений сохраняется, при необходимости может быть просмотрена
name = input('введите имя: ')
lastName = input('введите фамилию: ')
age = 2023 - int(input('введите год вашего рождения: '))
print(lastName, name + ',', age)

# КОММЕНТАРИЙ: правки выполняются в той части кода, где они требуются: можно изменением строчки кода, можно комментированием предыдущей некорректной строчки и добавлением новой строчки кода

# КОММЕНТАРИЙ: можно написать новый код, если объём правок в предыдущую версию настолько велик, что означает необходимость полностью переписать код: в таком случае предыдущая реализация комментируется целиком, а новая размещается сразу под предыдущей — но это чревато в случае работы с большими скриптами — очень неудобно отслеживать изменения в двух размещённых друг под другом фрагментах кода уже на полсотни строчек — не говоря про больше

# КОММЕНТАРИЙ: метка УДАЛИТЬ означает, что строчку или фрагмент кода необходимо удалить (внезапно)


# введите имя: Артур
# введите фамилию: Котляров
# введите год вашего рождения: 1993
# Котляров Артур, 30


# ИТОГ: хорошо — 2/3
