number = int(input('введите любое число: '))
# ИСПРАВИТЬ: лишние пробелы в выводе: в случае если вы будете генерировать строку не для человека, а для другой функции/класса/программы — это может стоить вам неработающего приложения
# print("Следующее за числом ", number, " число: ", number + 1, "\n Для числа", number, "предыдущее число:", number - 1)
# КОММЕНТАРИЙ: шутки изволите шутить? здесь не исправлено по сравнению с предыдущим вариантом ровным счётом ничего
print("Следующее за числом ", number, " число: ", number + 1, "\n Для числа", number, "предыдущее число:", number - 1)
# КОММЕНТАРИЙ: если непонятно, как или что исправлять, то напишите свой комментарий, задайте вопрос — кто вам мешает?
# КОММЕНТАРИЙ: а сдавать якобы переписанный вариант в котором ничего не изменено — это злонамеренное усложнение моей работы — к таким подходам я отношусь предельно жёстко


# КОММЕНТАРИЙ: это лукавство, результат работы вашего кода выглядит не так
# введите любое число: 354
# Следующее за числом 354 число: 355
# Для числа 354 предыдущее число: 353

# КОММЕНТАРИЙ: а вот так
# введите любое число: 354
# Следующее за числом  354  число:  355
#  Для числа 354 предыдущее число: 353

# СДЕЛАТЬ:
#  вы не должны копировать "результат работы" из примеров ввода/вывода в тексте задания;
#  вы не должны вручную редактировать результат работы своего кода;
#  всё, что вы должны сделать — это запустить собственный код со своими данными и скопировать результат без правок


# ИТОГ: доработать — 0/3
