number = int(input('введите любое число: '))
print("Следующее за числом ", number, " число: ", number + 1, "\n Для числа", number, "предыдущее число:", number -1)

# Написать программу, которая считывает целое число. 
# Программа должна вывести следующее и предыдущее целое число с пояснительным текстом.
