number = int(input('введите любое число: '))
# ИСПРАВИТЬ: лишние пробелы в выводе: в случае если вы будете генерировать строку не для человека, а для другой функции/класса/программы — это может стоить вам неработающего приложения
# print("Следующее за числом ", number, " число: ", number + 1, "\n Для числа", number, "предыдущее число:", number - 1)
# ИСПРАВИТЬ: лишние пробелы всё ещё остались
print("Следующее за числом ", number, " число: ", number + 1, "\nДля числа", number, "предыдущее число:", number - 1)
# КОММЕНТАРИЙ: если непонятно, как или что исправлять, то напишите свой комментарий, задайте вопрос


# КОММЕНТАРИЙ: это лукавство, результат работы вашего кода выглядит не так
# введите любое число: 354
# Следующее за числом 354 число: 355
# Для числа 354 предыдущее число: 353

# КОММЕНТАРИЙ: а вот так
# введите любое число: 354
# Следующее за числом  354  число:  355
#  Для числа 354 предыдущее число: 353

# СДЕЛАТЬ: после каждого исправления необходимо повторно выполнять свой код, смотреть на эффект исправления и добавлять в ответ результат работы исправленного кода

# введите любое число: 100
# КОММЕНТАРИЙ: лишние пробелы вокруг чисел
# Следующее за числом  100  число:  101
# Для числа 100 предыдущее число: 99


# ИТОГ: доработать — 1/3
