# number = int(input('введите любое число: '))
# ИСПРАВИТЬ: лишние пробелы в выводе: в случае если вы будете генерировать строку не для человека, а для другой функции/класса/программы — это может стоить вам неработающего приложения
# print("Следующее за числом ", number, " число: ", number + 1, "\n Для числа", number, "предыдущее число:", number -1)

# Написать программу, которая считывает целое число 
# Программа должна вывести следующее и предыдущее целое число с пояснительным текстом.

# ДОБАВИТЬ: результат выполнения программы с собственными данными



# ИТОГ: доработать — 1/3

number = int(input('введите любое число: '))

print("Следующее за числом ",number," число: ",number + 1,"\n Для числа",number,"предыдущее число:",number - 1)

# введите любое число: 354
# Следующее за числом 354 число: 355
# Для числа 354 предыдущее число: 353
