number = int(input('enter the number: '))
hour = number // 60
mins = number % 60
print(f'{number} минут = это {hour} часа {mins} минут')

# Написать программу для пересчёта величины временного интервала, 
# заданного в минутах, в величину, выраженную в часах и минутах.

# В этой задаче НУЖНО использовать f-строки.
